greetings_message = """Здравствуйте! Спасибо, что обратились в службу поддержки.
 
Выберите, пожалуйста, один из вариантов.

Eсли у вас пропало меню выбора ответа, нажмите справа на значок клавиатуры рядом со значком эмодзи."""


bonus_message = """Чтобы получить бонус, выполните несколько простых действий.
 
1. Откройте приложение Wildberries на телефоне.  
2. Нажмите на иконку профиля в нижнем правом углу.  
3. Выберите категорию «Покупки».
4. Выберите товар, на который хотите оставить отзыв.  
5. Найдите строчку «Отзывы», находится обычно под описанием товара.  
6. Нажмите кнопку «Написать отзыв».  
7. Поставьте товару 5 звезд.  
8. Напишите текстовый комментарий."""


screenshot_instructions_message = """Сделайте скриншот оставленного отзыва и пришлите его сюда (отправляйте, пожалуйста, только скриншот, без текста).

❗️ Скриншот необходимо сделать из личного раздела Ваших отзывов «Отзывы и вопросы» по ссылке https://www.wildberries.ru/lk/discussion/feedback, предварительно выполнив ВХОД в АККАУНТ (нажмите на иконку в правом нижнем углу).
❗️ Скриншоты отзыва из карточки товара и любые другие не принимаются."""


screenshot_failure_message = """Кажется, что-то не так

🥺 Пожалуйста, отправьте фотографию с отзывом, оставленным на наш товар.
"""


screenshot_success_message = """Прикрепите фото Вашего купона сюда (отправляйте, пожалуйста, только фотографию, без текста)."""

coupon_failure_message = """Кажется, что-то не так

🥺 Пожалуйста, отправьте фотографию купона"""


coupon_success_message = """Последний шаг. Напишите Ваш номер телефона, мы пополним его на сумму купона. 

Формат номера +7 ХХХ ХХХ ХХ ХХ"""


thanks_for_info_message = """Спасибо за предоставленную информацию. 

Проверка занимает до 48х часов. После проверки Вам будет зачислен бонус."""


number_failure_message = """🥺 Пожалуйста, отправьте номер в формате +7 ХХХ ХХХ ХХ ХХ"""

# q_and_shop
shop_message = """Спасибо за интерес, проявленный к нашему бренду!🥰


Следите за нами в этом чате) Скоро здесь появятся спецпредложения :)
 
Приобретайте наши товары на WB:  
https://www.wildberries.ru/brands/310828476-tifan

Приобретайте наши товары на OZON:  
https://www.ozon.ru/seller/tifan-756460/products/?miniapp=seller_756460

Всегда рады вам!"""


question_message = (
    """Расскажите, какой у Вас вопрос и мы быстро поможем решить Вашу проблему.\nЧтобы закончить общение с тех. поддержкой нажмите кнопку Вернуться в главное меню"""
)

question_feedback_message = (
    """Спасибо за Ваш вопрос. В ближайшее время менеджер подключится и поможет решить Ваш вопрос."""
)

support_start_message = (
    "Бот пересылает запросы на получение бонуса и "
    "обращения в поддержку от покупателей, "
    "при ответе на сообщения бот пересылает текст обратно"
    "\n\n"
    "Для просмотра статистики по уникальным пользователям и бонусам "
    "воспользуйтесь командой /stat"
    "\n"
    "`/stat 3` - статистика за третье число текущего месяца"
    "\n"
    "`/stat 3.12` - статистика за третье декабря этого года"
    "\n"
    "`/stat 3.12.23` - статистика за 3.12.32"
    "\n"
    "`/stat 3 5`, `/stat 1 31.12`, `/stat 3.12.24 4` - приводит статистику за период"
)
